InformationRegisters/ПротоколОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПротоколОбменов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаголовкиЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HTTPМетод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПротоколОбменов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Ресурсы ValueStorage недоступны в данных формы (Запись) — читаем отдельно из БД.
	Тексты = ТекстыРесурсовПротокола(Запись.ИдентификаторЗапроса);
	ТекстЗаголовки = Тексты.Заголовки;
	ТекстТелоЗапроса = Тексты.ТелоЗапроса;
	ТекстТелоОтвета = Тексты.ТелоОтвета;
	
КонецПроцедуры

&НаСервере
Функция ТекстыРесурсовПротокола(ИдентификаторЗапроса)
	
	Результат = Новый Структура("Заголовки, ТелоЗапроса, ТелоОтвета", "", "", "");
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторЗапроса = ИдентификаторЗапроса;
	МенеджерЗаписи.Прочитать();
	
	Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.Дата) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Заголовки = ТекстИзХранилища(МенеджерЗаписи.ЗаголовкиЗапроса);
	Результат.ТелоЗапроса = ТекстИзХранилища(МенеджерЗаписи.ТелоЗапроса);
	Результат.ТелоОтвета = ТекстИзХранилища(МенеджерЗаписи.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстИзХранилища(ЗначениеХранилища)
	
	Если НЕ ЗначениеЗаполнено(ЗначениеХранилища) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		Если ТипЗнч(ЗначениеХранилища) = Тип("ХранилищеЗначения") Тогда
			Значение = ЗначениеХранилища.Получить();
		Иначе
			Значение = ЗначениеХранилища;
		КонецЕсли;
		
		Если Значение = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Возврат Значение;
		КонецЕсли;
		
		Возврат Строка(Значение);
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции
